app/views/rocket_actions/show.html.erb

SELECT COUNT(*) FROM `employees` INNER JOIN `employee_rocket_action_associations` ON `employees`.`id` = `employee_rocket_action_associations`.`employee_id` WHERE `employee_rocket_action_associations`.`rocket_action_id` = 28
SELECT `employees`.* FROM `employees` INNER JOIN `employee_rocket_action_associations` ON `employees`.`id` = `employee_rocket_action_associations`.`employee_id` WHERE `employee_rocket_action_associations`.`rocket_action_id` = 28
---

<% if @rocket_action.employees.count > 0 %>