app/views/employees/association_form.html.erb

    <%= f.label :rocket_action, "Seleccione o Rocket Action que pertende associar ao empregado:" %><br>
    <%= f.collection_select(:rocket_action_id, RocketAction.select{ |r|  @employee.rocket_action_ids.exclude? r.id}, :id, :name) %>
---
SELECT `rocket_actions`.* FROM `rocket_actions` WHERE (rocket_action_id IN (1))