app/views/employees/show.html.erb


<% if @employee.rocket_actions.count > 0 %>
---
SELECT COUNT(*) FROM `rocket_actions` WHERE `rocket_actions`.`employee_id` = 16
SELECT `rocket_actions`.* FROM `rocket_actions` WHERE `rocket_actions`.`employee_id` = 16