app/controllers/employees_controller.rb

  def index
  	@employees = Employee.all
---
SELECT `employees`.* FROM `employees`

  def show
  	@employee = Employee.find(params[:id])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1

  def create
  	@employee = Employee.new(employee_params)
    if @employee.save
---
INSERT INTO `employees` (`birth_date`, `created_at`, `email`, `name`, `updated_at`) VALUES ('1991-05-31', '2014-03-25 15:17:24', 'alves@rupeal.com', 'Claudia', '2014-03-25 15:17:24')

  def edit
  	@employee = Employee.find(params[:id])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 3 LIMIT 1

  def update
  	@employee = Employee.find(params[:id])
    @employee.update_attributes(employee_params)
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 8 LIMIT 1
UPDATE `employees` SET `birth_date` = '1991-04-03', `updated_at` = '2014-03-26 11:24:53' WHERE `employees`.`id` = 8

  def destroy
  	@employee = Employee.find(params[:id])
  	if @employee.destroy
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
DELETE FROM `employees` WHERE `employees`.`id` = 1

  def association_form
    @employee = Employee.find(params[:employee_id])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 12 LIMIT 1

  def associate_rocket_action_to_employee
    rocket_action = RocketAction.find(associate_rocket_action_params[:rocket_action_id])
    employee = Employee.find(params[:employee_id])
    employee.rocket_actions << rocket_action unless employee.rocket_actions.include? rocket_action
    employee.update_total_points
---
SELECT `rocket_actions`.* FROM `rocket_actions` WHERE `rocket_actions`.`id` = 3 LIMIT 1
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 12 LIMIT 1
INSERT INTO `employees_rocket_actions` (`rocket_action_id`, `employee_id`) VALUES (3, 12)
SELECT 1 AS one FROM `rocket_actions` INNER JOIN `employee_rocket_action_associations` ON `rocket_actions`.`id` = `employee_rocket_action_associations`.`rocket_action_id` WHERE `employee_rocket_action_associations`.`employee_id` = 8 AND `rocket_actions`.`id` = 8 LIMIT 1
SELECT DISTINCT 1 AS one FROM `rocket_actions` INNER JOIN `employees_rocket_actions` ON `rocket_actions`.`id` = `employees_rocket_actions`.`rocket_action_id` WHERE `employees_rocket_actions`.`employee_id` = 12 AND `rocket_actions`.`id` = 8 LIMIT 1
UPDATE `employees` SET `total_points` = 12, `updated_at` = '2014-03-31 14:41:29' WHERE `employees`.`id` = 12
UPDATE `rocket_actions` SET `points` = 6, `updated_at` = '2014-04-01 14:48:58' WHERE `rocket_actions`.`id` = 1