app/controllers/rocket_actions_controller.rb

SELECT `rocket_actions`.* FROM `rocket_actions`
---
  def index
    @rocket_actions = RocketAction.all

SELECT `rocket_actions`.* FROM `rocket_actions` WHERE `rocket_actions`.`id` = 3 LIMIT 1
---
  def show
    @rocket_action = RocketAction.find(params[:id])

INSERT INTO `employees_rocket_actions` (`rocket_action_id`, `employee_id`) VALUES (8, 8)
INSERT INTO `rocket_actions` (`created_at`, `name`, `points`, `updated_at`) VALUES ('2014-03-28 15:51:25', 'rocket4', 10, '2014-03-28 15:51:25')
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 8 LIMIT 1
UPDATE `employees` SET `total_points` = 15, `updated_at` = '2014-03-31 10:21:18' WHERE `employees`.`id` = 14
---
  def create
    rocket_action = RocketAction.new(rocket_action_params)
    if rocket_action.save
      if (employee_id = params[:employee_id])!=nil
        employee = Employee.find(employee_id)
        rocket_action.employees << employee
        employee.update_total_points

SELECT `rocket_actions`.* FROM `rocket_actions` WHERE `rocket_actions`.`id` = 1 LIMIT 1
---
  def edit
    @rocket_action = RocketAction.find(params[:id])

SELECT `rocket_actions`.* FROM `rocket_actions` WHERE `rocket_actions`.`id` = 1 LIMIT 1
UPDATE `rocket_actions` SET `name` = 'rocket4', `updated_at` = '2014-03-28 12:36:02' WHERE `rocket_actions`.`id` = 1
---
  def update
    @rocket_action = RocketAction.find(params[:id])
    @rocket_action.update_attributes(rocket_action_params)

SELECT `rocket_actions`.* FROM `rocket_actions` WHERE `rocket_actions`.`id` = 4 LIMIT 1
DELETE FROM `employees_rocket_actions` WHERE `employees_rocket_actions`.`rocket_action_id` = 4
DELETE FROM `rocket_actions` WHERE `rocket_actions`.`id` = 4
---
  def destroy
    @rocket_action = RocketAction.find(params[:id])
    if @rocket_action.destroy